results/run-ai-scenario.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: ai-scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 15 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/15 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/15 VUs  0m02.0s/1m00.0s

running (0m03.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 01/15 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/15 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 02/15 VUs  0m04.0s/1m00.0s

running (0m05.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 02/15 VUs  0m05.0s/1m00.0s

running (0m06.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 02/15 VUs  0m06.0s/1m00.0s

running (0m07.0s), 02/15 VUs, 2 complete and 0 interrupted iterations
default   [  12% ] 02/15 VUs  0m07.0s/1m00.0s

running (0m08.0s), 03/15 VUs, 3 complete and 0 interrupted iterations
default   [  13% ] 03/15 VUs  0m08.0s/1m00.0s

running (0m09.0s), 03/15 VUs, 3 complete and 0 interrupted iterations
default   [  15% ] 03/15 VUs  0m09.0s/1m00.0s

running (0m10.0s), 03/15 VUs, 5 complete and 0 interrupted iterations
default   [  17% ] 03/15 VUs  0m10.0s/1m00.0s

running (0m11.0s), 03/15 VUs, 6 complete and 0 interrupted iterations
default   [  18% ] 03/15 VUs  0m11.0s/1m00.0s

running (0m12.0s), 04/15 VUs, 6 complete and 0 interrupted iterations
default   [  20% ] 04/15 VUs  0m12.0s/1m00.0s

running (0m13.0s), 04/15 VUs, 8 complete and 0 interrupted iterations
default   [  22% ] 04/15 VUs  0m13.0s/1m00.0s

running (0m14.0s), 04/15 VUs, 9 complete and 0 interrupted iterations
default   [  23% ] 04/15 VUs  0m14.0s/1m00.0s

running (0m15.0s), 04/15 VUs, 11 complete and 0 interrupted iterations
default   [  25% ] 04/15 VUs  0m15.0s/1m00.0s

running (0m16.0s), 05/15 VUs, 12 complete and 0 interrupted iterations
default   [  27% ] 05/15 VUs  0m16.0s/1m00.0s

running (0m17.0s), 05/15 VUs, 13 complete and 0 interrupted iterations
default   [  28% ] 05/15 VUs  0m17.0s/1m00.0s

running (0m18.0s), 05/15 VUs, 16 complete and 0 interrupted iterations
default   [  30% ] 05/15 VUs  0m18.0s/1m00.0s

running (0m19.0s), 06/15 VUs, 18 complete and 0 interrupted iterations
default   [  32% ] 06/15 VUs  0m19.0s/1m00.0s

running (0m20.0s), 06/15 VUs, 19 complete and 0 interrupted iterations
default   [  33% ] 06/15 VUs  0m20.0s/1m00.0s

running (0m21.0s), 06/15 VUs, 22 complete and 0 interrupted iterations
default   [  35% ] 06/15 VUs  0m21.0s/1m00.0s

running (0m22.0s), 07/15 VUs, 24 complete and 0 interrupted iterations
default   [  37% ] 07/15 VUs  0m22.0s/1m00.0s

running (0m23.0s), 07/15 VUs, 27 complete and 0 interrupted iterations
default   [  38% ] 07/15 VUs  0m23.0s/1m00.0s

running (0m24.0s), 07/15 VUs, 30 complete and 0 interrupted iterations
default   [  40% ] 07/15 VUs  0m24.0s/1m00.0s

running (0m25.0s), 08/15 VUs, 32 complete and 0 interrupted iterations
default   [  42% ] 08/15 VUs  0m25.0s/1m00.0s

running (0m26.0s), 08/15 VUs, 35 complete and 0 interrupted iterations
default   [  43% ] 08/15 VUs  0m26.0s/1m00.0s

running (0m27.0s), 08/15 VUs, 38 complete and 0 interrupted iterations
default   [  45% ] 08/15 VUs  0m27.0s/1m00.0s

running (0m28.0s), 09/15 VUs, 41 complete and 0 interrupted iterations
default   [  47% ] 09/15 VUs  0m28.0s/1m00.0s

running (0m29.0s), 09/15 VUs, 45 complete and 0 interrupted iterations
default   [  48% ] 09/15 VUs  0m29.0s/1m00.0s

running (0m30.0s), 09/15 VUs, 48 complete and 0 interrupted iterations
default   [  50% ] 09/15 VUs  0m30.0s/1m00.0s

running (0m31.0s), 10/15 VUs, 51 complete and 0 interrupted iterations
default   [  52% ] 10/15 VUs  0m31.0s/1m00.0s

running (0m32.0s), 10/15 VUs, 55 complete and 0 interrupted iterations
default   [  53% ] 10/15 VUs  0m32.0s/1m00.0s

running (0m33.0s), 10/15 VUs, 59 complete and 0 interrupted iterations
default   [  55% ] 10/15 VUs  0m33.0s/1m00.0s

running (0m34.0s), 11/15 VUs, 62 complete and 0 interrupted iterations
default   [  57% ] 11/15 VUs  0m34.0s/1m00.0s

running (0m35.0s), 11/15 VUs, 67 complete and 0 interrupted iterations
default   [  58% ] 11/15 VUs  0m35.0s/1m00.0s

running (0m36.0s), 11/15 VUs, 71 complete and 0 interrupted iterations
default   [  60% ] 11/15 VUs  0m36.0s/1m00.0s

running (0m37.0s), 12/15 VUs, 76 complete and 0 interrupted iterations
default   [  62% ] 12/15 VUs  0m37.0s/1m00.0s

running (0m38.0s), 12/15 VUs, 79 complete and 0 interrupted iterations
default   [  63% ] 12/15 VUs  0m38.0s/1m00.0s

running (0m39.0s), 12/15 VUs, 84 complete and 0 interrupted iterations
default   [  65% ] 12/15 VUs  0m39.0s/1m00.0s

running (0m40.0s), 13/15 VUs, 88 complete and 0 interrupted iterations
default   [  67% ] 13/15 VUs  0m40.0s/1m00.0s

running (0m41.0s), 13/15 VUs, 94 complete and 0 interrupted iterations
default   [  68% ] 13/15 VUs  0m41.0s/1m00.0s

running (0m42.0s), 13/15 VUs, 99 complete and 0 interrupted iterations
default   [  70% ] 13/15 VUs  0m42.0s/1m00.0s

running (0m43.0s), 14/15 VUs, 103 complete and 0 interrupted iterations
default   [  72% ] 14/15 VUs  0m43.0s/1m00.0s

running (0m44.0s), 14/15 VUs, 109 complete and 0 interrupted iterations
default   [  73% ] 14/15 VUs  0m44.0s/1m00.0s

running (0m45.0s), 14/15 VUs, 114 complete and 0 interrupted iterations
default   [  75% ] 14/15 VUs  0m45.0s/1m00.0s

running (0m46.0s), 15/15 VUs, 120 complete and 0 interrupted iterations
default   [  77% ] 15/15 VUs  0m46.0s/1m00.0s

running (0m47.0s), 15/15 VUs, 126 complete and 0 interrupted iterations
default   [  78% ] 15/15 VUs  0m47.0s/1m00.0s

running (0m48.0s), 14/15 VUs, 131 complete and 0 interrupted iterations
default   [  80% ] 14/15 VUs  0m48.0s/1m00.0s

running (0m49.0s), 13/15 VUs, 137 complete and 0 interrupted iterations
default   [  82% ] 13/15 VUs  0m49.0s/1m00.0s

running (0m50.0s), 11/15 VUs, 143 complete and 0 interrupted iterations
default   [  83% ] 11/15 VUs  0m50.0s/1m00.0s

running (0m51.0s), 11/15 VUs, 146 complete and 0 interrupted iterations
default   [  85% ] 11/15 VUs  0m51.0s/1m00.0s

running (0m52.0s), 09/15 VUs, 151 complete and 0 interrupted iterations
default   [  87% ] 09/15 VUs  0m52.0s/1m00.0s

running (0m53.0s), 09/15 VUs, 156 complete and 0 interrupted iterations
default   [  88% ] 09/15 VUs  0m53.0s/1m00.0s

running (0m54.0s), 08/15 VUs, 159 complete and 0 interrupted iterations
default   [  90% ] 08/15 VUs  0m54.0s/1m00.0s

running (0m55.0s), 07/15 VUs, 163 complete and 0 interrupted iterations
default   [  92% ] 07/15 VUs  0m55.0s/1m00.0s

running (0m56.0s), 06/15 VUs, 165 complete and 0 interrupted iterations
default   [  93% ] 06/15 VUs  0m56.0s/1m00.0s

running (0m57.0s), 05/15 VUs, 168 complete and 0 interrupted iterations
default   [  95% ] 05/15 VUs  0m57.0s/1m00.0s

running (0m58.0s), 04/15 VUs, 170 complete and 0 interrupted iterations
default   [  97% ] 04/15 VUs  0m58.0s/1m00.0s

running (0m59.0s), 03/15 VUs, 173 complete and 0 interrupted iterations
default   [  98% ] 03/15 VUs  0m59.0s/1m00.0s

running (1m00.0s), 02/15 VUs, 174 complete and 0 interrupted iterations
default   [ 100% ] 02/15 VUs  1m00.0s/1m00.0s

running (1m01.0s), 02/15 VUs, 174 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/15 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=234.67ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 352     5.681088/s
    checks_succeeded...: 100.00% 352 out of 352
    checks_failed......: 0.00%   0 out of 352

    ✓ нүүр хуудасны статус 200
    ✓ хайлт амжилттай 200

    HTTP
    http_req_duration..............: avg=145.4ms min=53ms  med=210.36ms max=434.03ms p(90)=231.64ms p(95)=234.67ms
      { expected_response:true }...: avg=145.4ms min=53ms  med=210.36ms max=434.03ms p(90)=231.64ms p(95)=234.67ms
    http_req_failed................: 0.00%  0 out of 704
    http_reqs......................: 704    11.362176/s

    EXECUTION
    iteration_duration.............: avg=2.63s   min=2.55s med=2.57s    max=4.13s    p(90)=2.76s    p(95)=3.14s   
    iterations.....................: 176    2.840544/s
    vus............................: 2      min=1        max=15
    vus_max........................: 15     min=15       max=15

    NETWORK
    data_received..................: 1.4 MB 23 kB/s
    data_sent......................: 124 kB 2.0 kB/s



running (1m02.0s), 00/15 VUs, 176 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/15 VUs  1m0s